In [2]:
import pandas as pd
import datetime as dt
import warnings
warnings.filterwarnings('ignore')

## Review of Python's `datetime` Module

## Date

In [3]:
someday = dt.date(2010, 1, 20)
type(someday)

datetime.date

In [4]:
print(someday.year)
print(someday.month)
print(someday.day)

2010
1
20

In [5]:
str(someday)

'2010-01-20'

## Date and Time

In [6]:
sometime = dt.datetime(2010, 1, 10, 17, 13, 57)
type(sometime)

datetime.datetime

In [7]:
str(dt.datetime(2010, 1, 10, 17, 13, 57))

'2010-01-10 17:13:57'

In [8]:
print(sometime.year)
print(sometime.month)
print(sometime.day)
print(sometime.hour)
print(sometime.minute)
print(sometime.second)

2010
1
10
17
13
57

## The `pandas Timestamp` Object

In [9]:
print(pd.Timestamp("2015-03-31"))
print(pd.Timestamp("2015/03/31"))
print(pd.Timestamp("2013, 11, 04"))

2015-03-31 00:00:00
2015-03-31 00:00:00
2013-11-04 00:00:00

In [10]:
print(pd.Timestamp("1/1/2015"))
print(pd.Timestamp("19/12/2015"))
print(pd.Timestamp("12/19/2015"))
print(pd.Timestamp("4/3/2000"))

2015-01-01 00:00:00
2015-12-19 00:00:00
2015-12-19 00:00:00
2000-04-03 00:00:00

In [11]:
print(pd.Timestamp("2021-03-08 08:35:15"))
print(pd.Timestamp("2021-03-08 6:13:29 PM"))

2021-03-08 08:35:15
2021-03-08 18:13:29

## Convert a date or datetime into pandas Timestamp

In [12]:
pd.Timestamp(dt.date(2015, 1, 1))

Timestamp('2015-01-01 00:00:00')

In [13]:
pd.Timestamp(dt.datetime(2000, 2, 3, 21, 35, 22))

Timestamp('2000-02-03 21:35:22')

## The `pandas DateTimeIndex` Object

In [14]:
dates = ["2016/01/02", "2016/04/12", "2009/09/07"]
pd.DatetimeIndex(dates)

DatetimeIndex(['2016-01-02', '2016-04-12', '2009-09-07'], dtype='datetime64[ns]', freq=None)

In [15]:
dates = [dt.date(2016, 1, 10), dt.date(1994, 6, 13), dt.date(2003, 12, 29)]
dtIndex = pd.DatetimeIndex(dates)

In [16]:
values = [100, 200, 300]
pd.Series(data = values, index = dtIndex)

2016-01-10    100
1994-06-13    200
2003-12-29    300
dtype: int64

## The `pd.to_datetime()` Method

In [17]:
pd.to_datetime("2001-04-19")
pd.to_datetime(dt.date(2015, 1, 1))
pd.to_datetime(dt.datetime(2015, 1, 1, 14, 35, 20))
pd.to_datetime(["2015-01-03", "2014/02/08", "2016", "July 4th, 1996"])

DatetimeIndex(['2015-01-03', '2014-02-08', '2016-01-01', '1996-07-04'], dtype='datetime64[ns]', freq=None)

In [18]:
times = pd.Series(["2015-01-03", "2014/02/08", "2016", "July 4th, 1996"])
times

0        2015-01-03
1        2014/02/08
2              2016
3    July 4th, 1996
dtype: object

In [19]:
pd.to_datetime(times)

0   2015-01-03
1   2014-02-08
2   2016-01-01
3   1996-07-04
dtype: datetime64[ns]

In [20]:
dates = pd.Series(["July 4th, 1996", "10/04/1991", "Hello", "2015-02-31"])
dates

0    July 4th, 1996
1        10/04/1991
2             Hello
3        2015-02-31
dtype: object

In [21]:
pd.to_datetime(dates, errors = "coerce")

0   1996-07-04
1   1991-10-04
2          NaT
3          NaT
dtype: datetime64[ns]

In [22]:
pd.to_datetime([0, 120, 1349720105, 1349806505, 1349892905, 1349979305, 1350065705], unit = "s")

DatetimeIndex(['1970-01-01 00:00:00', '1970-01-01 00:02:00',
               '2012-10-08 18:15:05', '2012-10-09 18:15:05',
               '2012-10-10 18:15:05', '2012-10-11 18:15:05',
               '2012-10-12 18:15:05'],
              dtype='datetime64[ns]', freq=None)

## Period and PeriodIndex

In [23]:
pidx = pd.Period("2016-01-08", freq = "10D")

pidx

Period('2016-01-08', '10D')

In [24]:
# Create the PeriodIndex object 
pidx = pd.PeriodIndex(start ='2004-11-11 02:45:21 ', end ='2021-5-21 8:45:29', freq ='Y') 
  
# Print the PeriodIndex object 
print(pidx)

PeriodIndex(['2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011',
             '2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019',
             '2020', '2021'],
            dtype='period[A-DEC]', freq='A-DEC')

In [25]:
dates = ["2016-01-01", "2016-02-01", "2016-03-01"]
pd.Series([1, 2, 3], index = pd.PeriodIndex(dates, freq = "2M"))

2016-01    1
2016-02    2
2016-03    3
Freq: 2M, dtype: int64

In [26]:
pd.Period("2016-01-08", freq = "W")

Period('2016-01-04/2016-01-10', 'W-SUN')

In [27]:
pd.Period("2016-01-08", freq = "W-SUN")

Period('2016-01-04/2016-01-10', 'W-SUN')

In [28]:
pd.Period("2016-01-08", freq = "W-WED")
pd.Period("2015-12-10", freq = "10D")

dates = ["2016-01-01", "2016-02-01", "2016-02-01"]
pd.PeriodIndex(dates, freq = "W-MON")
weeks = pd.PeriodIndex(dates, freq = "W-MON")

pd.Series([999, 500, 325], index = weeks, name = "Weekly Revenue")

2015-12-29/2016-01-04    999
2016-01-26/2016-02-01    500
2016-01-26/2016-02-01    325
Freq: W-MON, Name: Weekly Revenue, dtype: int64

## Create Range of Dates with the `pd.date_range()` Method

In [29]:
times = pd.date_range(start = "2016-01-01", end = "2016-01-10", freq = "D")

In [30]:
type(times)

pandas.core.indexes.datetimes.DatetimeIndex

In [31]:
type(times[0])

pandas._libs.tslibs.timestamps.Timestamp

In [32]:
times

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06', '2016-01-07', '2016-01-08',
               '2016-01-09', '2016-01-10'],
              dtype='datetime64[ns]', freq='D')

In [33]:
pd.date_range(start = "2016-01-01", end = "2050-01-01", freq = "A")

DatetimeIndex(['2016-12-31', '2017-12-31', '2018-12-31', '2019-12-31',
               '2020-12-31', '2021-12-31', '2022-12-31', '2023-12-31',
               '2024-12-31', '2025-12-31', '2026-12-31', '2027-12-31',
               '2028-12-31', '2029-12-31', '2030-12-31', '2031-12-31',
               '2032-12-31', '2033-12-31', '2034-12-31', '2035-12-31',
               '2036-12-31', '2037-12-31', '2038-12-31', '2039-12-31',
               '2040-12-31', '2041-12-31', '2042-12-31', '2043-12-31',
               '2044-12-31', '2045-12-31', '2046-12-31', '2047-12-31',
               '2048-12-31', '2049-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

# +++++++++++++++++++++++++++++++++++++++++++++++++++++

## Create Range of Dates with the `pd.date_range()` Method

In [34]:
pd.date_range(start = "2012-09-09", periods = 50, freq = "6H")

DatetimeIndex(['2012-09-09 00:00:00', '2012-09-09 06:00:00',
               '2012-09-09 12:00:00', '2012-09-09 18:00:00',
               '2012-09-10 00:00:00', '2012-09-10 06:00:00',
               '2012-09-10 12:00:00', '2012-09-10 18:00:00',
               '2012-09-11 00:00:00', '2012-09-11 06:00:00',
               '2012-09-11 12:00:00', '2012-09-11 18:00:00',
               '2012-09-12 00:00:00', '2012-09-12 06:00:00',
               '2012-09-12 12:00:00', '2012-09-12 18:00:00',
               '2012-09-13 00:00:00', '2012-09-13 06:00:00',
               '2012-09-13 12:00:00', '2012-09-13 18:00:00',
               '2012-09-14 00:00:00', '2012-09-14 06:00:00',
               '2012-09-14 12:00:00', '2012-09-14 18:00:00',
               '2012-09-15 00:00:00', '2012-09-15 06:00:00',
               '2012-09-15 12:00:00', '2012-09-15 18:00:00',
               '2012-09-16 00:00:00', '2012-09-16 06:00:00',
               '2012-09-16 12:00:00', '2012-09-16 18:00:00',
               '2012-09-17 00:00:00', '2012-09-17 06:00:00',
               '2012-09-17 12:00:00', '2012-09-17 18:00:00',
               '2012-09-18 00:00:00', '2012-09-18 06:00:00',
               '2012-09-18 12:00:00', '2012-09-18 18:00:00',
               '2012-09-19 00:00:00', '2012-09-19 06:00:00',
               '2012-09-19 12:00:00', '2012-09-19 18:00:00',
               '2012-09-20 00:00:00', '2012-09-20 06:00:00',
               '2012-09-20 12:00:00', '2012-09-20 18:00:00',
               '2012-09-21 00:00:00', '2012-09-21 06:00:00'],
              dtype='datetime64[ns]', freq='6H')

## The `.dt` Accessor

In [35]:
bunch_of_dates = pd.date_range(start = "2000-01-01", end = "2010-12-31", freq = "24D")
bunch_of_dates

DatetimeIndex(['2000-01-01', '2000-01-25', '2000-02-18', '2000-03-13',
               '2000-04-06', '2000-04-30', '2000-05-24', '2000-06-17',
               '2000-07-11', '2000-08-04',
               ...
               '2010-05-20', '2010-06-13', '2010-07-07', '2010-07-31',
               '2010-08-24', '2010-09-17', '2010-10-11', '2010-11-04',
               '2010-11-28', '2010-12-22'],
              dtype='datetime64[ns]', length=168, freq='24D')

In [36]:
s = pd.Series(bunch_of_dates)
s

0     2000-01-01
1     2000-01-25
2     2000-02-18
3     2000-03-13
4     2000-04-06
         ...
163   2010-09-17
164   2010-10-11
165   2010-11-04
166   2010-11-28
167   2010-12-22
Length: 168, dtype: datetime64[ns]

In [37]:
mask = s.dt.is_month_end
s[mask]

5     2000-04-30
57    2003-09-30
71    2004-08-31
90    2005-11-30
123   2008-01-31
161   2010-07-31
dtype: datetime64[ns]

In [38]:
mask = s.dt.is_month_start
s[mask]

0     2000-01-01
19    2001-04-01
38    2002-07-01
104   2006-11-01
109   2007-03-01
137   2009-01-01
142   2009-05-01
dtype: datetime64[ns]

In [39]:
mask = s.dt.is_year_start
s[mask]

0     2000-01-01
137   2009-01-01
dtype: datetime64[ns]


# ++++++++++++++++++++++++++++++++++++++++++++++++++
## Import Financial Data Set with `pandas_datareader` Library

In [40]:
import pandas as pd
import datetime as dt
from pandas_datareader import data
import warnings
warnings.filterwarnings('ignore')

In [41]:
company = "MSFT"
start = "2010-01-01"
end = "2017-12-31"

stocks = data.DataReader(name = company, data_source = "yahoo", start = start, end = end)
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2009-12-31  30.99  30.480000  30.980000  30.480000  31929700.0  23.858992
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  24.226894
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  24.234720

In [42]:
stocks.columns

Index(['High', 'Low', 'Open', 'Close', 'Volume', 'Adj Close'], dtype='object')

In [43]:
stocks.values

array([[3.09899998e+01, 3.04799995e+01, 3.09799995e+01, 3.04799995e+01,
        3.19297000e+07, 2.38589916e+01],
       [3.11000004e+01, 3.05900002e+01, 3.06200008e+01, 3.09500008e+01,
        3.84091000e+07, 2.42268944e+01],
       [3.11000004e+01, 3.06399994e+01, 3.08500004e+01, 3.09599991e+01,
        4.97496000e+07, 2.42347202e+01],
       ...,
       [8.59800034e+01, 8.52200012e+01, 8.56500015e+01, 8.57099991e+01,
        1.46780000e+07, 8.25677872e+01],
       [8.59300003e+01, 8.55500031e+01, 8.59000015e+01, 8.57200012e+01,
        1.05943000e+07, 8.25774231e+01],
       [8.60500031e+01, 8.55000000e+01, 8.56299973e+01, 8.55400009e+01,
        1.87174000e+07, 8.24040375e+01]])

In [44]:
stocks.index[0]

Timestamp('2009-12-31 00:00:00')

In [45]:
stocks.axes

[DatetimeIndex(['2009-12-31', '2010-01-04', '2010-01-05', '2010-01-06',
                '2010-01-07', '2010-01-08', '2010-01-11', '2010-01-12',
                '2010-01-13', '2010-01-14',
                ...
                '2017-12-15', '2017-12-18', '2017-12-19', '2017-12-20',
                '2017-12-21', '2017-12-22', '2017-12-26', '2017-12-27',
                '2017-12-28', '2017-12-29'],
               dtype='datetime64[ns]', name='Date', length=2014, freq=None),
 Index(['High', 'Low', 'Open', 'Close', 'Volume', 'Adj Close'], dtype='object')]

## Selecting from a `DataFrame` with a `DateTimeIndex`

In [46]:
stocks = data.DataReader(name = company, data_source = "yahoo", start = start, end = end)
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2009-12-31  30.99  30.480000  30.980000  30.480000  31929700.0  23.858992
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  24.226894
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  24.234720

In [47]:
stocks.loc["2010-01-04",:]

High         3.110000e+01
Low          3.059000e+01
Open         3.062000e+01
Close        3.095000e+01
Volume       3.840910e+07
Adj Close    2.422689e+01
Name: 2010-01-04 00:00:00, dtype: float64

In [48]:
stocks.iloc[300,:]

High         2.585000e+01
Low          2.536000e+01
Open         2.541000e+01
Close        2.568000e+01
Volume       4.990580e+07
Adj Close    2.064161e+01
Name: 2011-03-11 00:00:00, dtype: float64

In [49]:
stocks.ix["2010-01-04",:]

High         3.110000e+01
Low          3.059000e+01
Open         3.062000e+01
Close        3.095000e+01
Volume       3.840910e+07
Adj Close    2.422689e+01
Name: 2010-01-04 00:00:00, dtype: float64

In [50]:
stocks.loc["2013-10-01" : "2013-10-07",:]

                 High        Low       Open      Close      Volume  Adj Close
Date
2013-10-01  33.610001  33.299999  33.349998  33.580002  36718700.0  28.962389
2013-10-02  34.029999  33.290001  33.360001  33.919998  46946800.0  29.255632
2013-10-03  34.000000  33.419998  33.880001  33.860001  38703800.0  29.203878
2013-10-04  33.990002  33.619999  33.689999  33.880001  33008100.0  29.221130
2013-10-07  33.709999  33.200001  33.599998  33.299999  35069300.0  28.720888

In [51]:
stocks.ix["2013-10-01" : "2013-10-07",:]

                 High        Low       Open      Close      Volume  Adj Close
Date
2013-10-01  33.610001  33.299999  33.349998  33.580002  36718700.0  28.962389
2013-10-02  34.029999  33.290001  33.360001  33.919998  46946800.0  29.255632
2013-10-03  34.000000  33.419998  33.880001  33.860001  38703800.0  29.203878
2013-10-04  33.990002  33.619999  33.689999  33.880001  33008100.0  29.221130
2013-10-07  33.709999  33.200001  33.599998  33.299999  35069300.0  28.720888

In [52]:
stocks.ix[300,:]

High         2.585000e+01
Low          2.536000e+01
Open         2.541000e+01
Close        2.568000e+01
Volume       4.990580e+07
Adj Close    2.064161e+01
Name: 2011-03-11 00:00:00, dtype: float64

In [89]:
selected_days = pd.date_range(start = "2005-04-12", end = "2017-12-31", freq = pd.DateOffset(years = 1))

In [90]:
mask = stocks.index.isin(selected_days)

In [91]:
stocks[mask]

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2005-04-12,96.846992,94.351349,96.139648,96.617851,14694000.0,96.617851
2006-04-12,204.897003,201.838455,203.736343,203.711441,12079000.0,203.711441
2007-04-12,233.126190,230.256943,231.133652,232.822327,5436000.0,232.822327
2010-04-12,285.928284,282.052795,282.615692,285.295654,4722400.0,285.295654
2011-04-12,287.377838,282.964386,286.426392,284.239594,4186700.0,284.239594
2012-04-12,325.350494,318.934540,319.975647,324.289490,11556300.0,324.289490
2013-04-12,394.571045,390.003174,394.516266,393.549866,3285500.0,393.549866
2016-04-12,743.830017,731.010010,738.000000,743.090027,1353000.0,743.090027
2017-04-12,826.659973,821.020020,821.929993,824.320007,900500.0,824.320007

## `Timestamp` Object Attributes

In [56]:
stocks = data.DataReader(name = company, data_source = "yahoo", start = start, end = end)
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2009-12-31  30.99  30.480000  30.980000  30.480000  31929700.0  23.858992
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  24.226894
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  24.234720

In [57]:
someday = stocks.index[500]
someday

Timestamp('2011-12-23 00:00:00')

In [58]:
print(someday.day)
print(someday.month)
print(someday.year)
print(someday.weekday_name)
print(someday.is_month_end)
print(someday.is_month_start)

23
12
2011
Friday
False
False

In [59]:
stocks.insert(0, "Day of Week", stocks.index.weekday_name)

In [60]:
stocks.insert(1, "Is Start of Month", stocks.index.is_month_start)

In [61]:
stocks

,Day of Week,Is Start of Month,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,,,
2009-12-31,Thursday,False,30.990000,30.480000,30.980000,30.480000,31929700.0,23.858992
2010-01-04,Monday,False,31.100000,30.590000,30.620001,30.950001,38409100.0,24.226894
2010-01-05,Tuesday,False,31.100000,30.639999,30.850000,30.959999,49749600.0,24.234720
2010-01-06,Wednesday,False,31.080000,30.520000,30.879999,30.770000,58182400.0,24.085989
2010-01-07,Thursday,False,30.700001,30.190001,30.629999,30.450001,50559700.0,23.835503
...,...,...,...,...,...,...,...,...
2017-12-22,Friday,False,85.629997,84.919998,85.400002,85.510002,14145800.0,82.375114
2017-12-26,Tuesday,False,85.529999,85.029999,85.309998,85.400002,9891200.0,82.269165
2017-12-27,Wednesday,False,85.980003,85.220001,85.650002,85.709999,14678000.0,82.567787
2017-12-28,Thursday,False,85.930000,85.550003,85.900002,85.720001,10594300.0,82.577423
2017-12-29,Friday,False,86.050003,85.500000,85.629997,85.540001,18717400.0,82.404037

In [62]:
stocks[stocks["Is Start of Month"]]

,Day of Week,Is Start of Month,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,,,
2010-02-01,Monday,True,28.480000,27.920000,28.389999,28.410000,85931100.0,22.238642
2010-03-01,Monday,True,29.049999,28.530001,28.770000,29.020000,43805400.0,22.822367
2010-04-01,Thursday,True,29.540001,28.620001,29.350000,29.160000,74768100.0,22.932465
2010-06-01,Tuesday,True,26.309999,25.520000,25.530001,25.889999,76152400.0,20.452698
2010-07-01,Thursday,True,23.320000,22.730000,23.090000,23.160000,92239400.0,18.296041
...,...,...,...,...,...,...,...,...
2017-06-01,Thursday,True,70.610001,69.449997,70.239998,70.099998,21603600.0,66.836517
2017-08-01,Tuesday,True,73.419998,72.489998,73.099998,72.580002,22132300.0,69.201080
2017-09-01,Friday,True,74.739998,73.639999,74.709999,73.940002,21736200.0,70.873360
2017-11-01,Wednesday,True,83.760002,82.879997,83.680000,83.180000,22307400.0,79.730133
2017-12-01,Friday,True,84.809998,83.220001,83.599998,84.260002,29532100.0,81.170952

## The `.truncate()` Method

In [63]:
stocks = data.DataReader(name = company, data_source ="yahoo", start = start, end = end)
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2009-12-31  30.99  30.480000  30.980000  30.480000  31929700.0  23.858992
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  24.226894
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  24.234720

In [64]:
stocks.truncate(before = "2012-06-07", after = "2013-02-28")

                 High        Low       Open      Close      Volume  Adj Close
Date
2012-06-07  29.700001  29.170000  29.639999  29.230000  37792800.0  24.293804
2012-06-08  29.680000  29.049999  29.209999  29.650000  42551100.0  24.642878
2012-06-11  29.809999  28.820000  29.730000  28.900000  46361900.0  24.019535
2012-06-12  29.299999  28.840000  29.100000  29.290001  35337900.0  24.343674
2012-06-13  29.440001  29.049999  29.219999  29.129999  32984600.0  24.210691
...               ...        ...        ...        ...         ...        ...
2013-02-22  27.760000  27.480000  27.680000  27.760000  31425900.0  23.609608
2013-02-25  28.049999  27.370001  27.969999  27.370001  48011800.0  23.277916
2013-02-26  27.600000  27.340000  27.379999  27.370001  49923300.0  23.277916
2013-02-27  28.000000  27.330000  27.420000  27.809999  36394700.0  23.652130
2013-02-28  27.969999  27.740000  27.879999  27.799999  35840200.0  23.643627

[182 rows x 6 columns]

## `pd.DateOffset` Objects

In [65]:
stocks = data.DataReader(name = "GOOG", data_source = "yahoo",
                start = dt.date(2000, 1, 1), end = dt.datetime.now())
stocks.head(3)

                 High        Low       Open      Close      Volume  Adj Close
Date
2004-08-19  51.835709  47.800831  49.813286  49.982655  44871300.0  49.982655
2004-08-20  54.336334  50.062355  50.316402  53.952770  22942800.0  53.952770
2004-08-23  56.528118  54.321388  55.168217  54.495735  18342800.0  54.495735

In [66]:
stocks.index + pd.DateOffset(months = 8, years = 5, days = 12, hours = 3, minutes = 42)

DatetimeIndex(['2010-05-01 03:42:00', '2010-05-02 03:42:00',
               '2010-05-05 03:42:00', '2010-05-06 03:42:00',
               '2010-05-07 03:42:00', '2010-05-08 03:42:00',
               '2010-05-09 03:42:00', '2010-05-12 03:42:00',
               '2010-05-12 03:42:00', '2010-05-13 03:42:00',
               ...
               '2026-04-18 03:42:00', '2026-04-19 03:42:00',
               '2026-04-22 03:42:00', '2026-04-23 03:42:00',
               '2026-04-24 03:42:00', '2026-04-25 03:42:00',
               '2026-04-26 03:42:00', '2026-04-29 03:42:00',
               '2026-04-30 03:42:00', '2026-05-01 03:42:00'],
              dtype='datetime64[ns]', name='Date', length=4029, freq=None)

## More Fun with `pd.DateOffset` Objects

In [67]:
import pandas as pd
import datetime as dt
from pandas_datareader import data
from pandas.tseries.offsets import *

In [95]:
stocks = data.DataReader(name = "GOOG", data_source = "yahoo",
                start = dt.date(2000, 1, 1), end = dt.datetime.now())

stocks.head(10)

                 High        Low       Open      Close      Volume  Adj Close
Date
2004-08-19  51.835709  47.800831  49.813286  49.982655  44871300.0  49.982655
2004-08-20  54.336334  50.062355  50.316402  53.952770  22942800.0  53.952770
2004-08-23  56.528118  54.321388  55.168217  54.495735  18342800.0  54.495735
2004-08-24  55.591629  51.591621  55.412300  52.239193  15319700.0  52.239193
2004-08-25  53.798351  51.746044  52.284027  52.802086   9232100.0  52.802086
2004-08-26  53.773445  52.134586  52.279045  53.753517   7128600.0  53.753517
2004-08-27  54.107193  52.647663  53.848164  52.876804   6241200.0  52.876804
2004-08-30  52.548038  50.814533  52.443428  50.814533   5221400.0  50.814533
2004-08-31  51.661362  50.889256  50.958992  50.993862   4941200.0  50.993862
2004-09-01  51.292744  49.648903  51.158245  49.937820   9181600.0  49.937820

In [101]:
stocks.index[:10] - MonthEnd()

#stocks.index - BMonthEnd()
#stocks.index - QuarterEnd()
#stocks.index - QuarterBegin()
#stocks.index - YearBegin()

DatetimeIndex(['2004-07-31', '2004-07-31', '2004-07-31', '2004-07-31',
               '2004-07-31', '2004-07-31', '2004-07-31', '2004-07-31',
               '2004-07-31', '2004-08-31'],
              dtype='datetime64[ns]', name='Date', freq=None)

In [113]:
shift_index = stocks.index[:100] + MonthEnd()

#stocks.loc[shift_index,:]
#stocks.loc[shift_index,:].drop_duplicates()
stocks.loc[shift_index,:].drop_duplicates().dropna()

                 High        Low       Open      Close      Volume  Adj Close
Date
2004-08-31  51.661362  50.889256  50.958992  50.993862   4941200.0  50.993862
2004-09-30  65.902977  64.259140  64.707458  64.558022  13823300.0  64.558022
2004-11-30  91.158318  89.788452  90.017593  90.650223  15457600.0  90.650223
2004-12-31  99.566803  95.920464  99.243011  96.035034  15394400.0  96.035034
2005-01-31  97.813370  95.502037  96.483360  97.444756  19265200.0  97.444756

## The `Timedelta` Object

In [71]:
timeA = pd.Timestamp("2016-03-31 04:35:16 PM")
timeB = pd.Timestamp("2016-03-20 02:16:49 AM")

In [72]:
timeB - timeA

Timedelta('-12 days +09:41:33')

In [73]:
type(timeA - timeB)

pandas._libs.tslibs.timedeltas.Timedelta

In [74]:
type(timeA)

pandas._libs.tslibs.timestamps.Timestamp

In [75]:
pd.Timedelta(weeks = 8, days = 3, hours = 12, minutes = 45)

Timedelta('59 days 12:45:00')

In [76]:
pd.Timedelta("14 days 6 hours 12 minutes 49 seconds")

Timedelta('14 days 06:12:49')

# +++++++++++++++++++++++++++++++++++++++++++++++++++

## `Timedeltas` in a Dataset

In [77]:
shipping = pd.read_csv("ecommerce.csv", index_col = "ID", parse_dates = ["order_date", "delivery_date"])
shipping.head(3)

   order_date delivery_date
ID
1  1998-05-24    1999-02-05
2  1992-04-22    1998-03-06
4  1991-02-10    1992-08-26

In [78]:
shipping["Delivery Time"] = shipping["delivery_date"] - shipping["order_date"]

In [79]:
shipping.head(3)

   order_date delivery_date Delivery Time
ID
1  1998-05-24    1999-02-05      257 days
2  1992-04-22    1998-03-06     2144 days
4  1991-02-10    1992-08-26      563 days

In [80]:
shipping["Twice As Long"] = shipping["delivery_date"] + shipping["Delivery Time"]

In [81]:
shipping.head(3)

   order_date delivery_date Delivery Time Twice As Long
ID
1  1998-05-24    1999-02-05      257 days    1999-10-20
2  1992-04-22    1998-03-06     2144 days    2004-01-18
4  1991-02-10    1992-08-26      563 days    1994-03-12

In [82]:
shipping.dtypes

order_date        datetime64[ns]
delivery_date     datetime64[ns]
Delivery Time    timedelta64[ns]
Twice As Long     datetime64[ns]
dtype: object

In [83]:
mask = shipping["Delivery Time"] == "3423 days"
shipping[mask]

    order_date delivery_date Delivery Time Twice As Long
ID
130 1990-04-02    1999-08-16     3423 days    2008-12-29

In [84]:
shipping["Delivery Time"].min()

Timedelta('8 days 00:00:00')